src/facturaelectronica/request.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Header/>
<soap:Body>
    <FECAESolicitar xmlns="http://ar.gov.afip.dif.FEV1/">
    <Auth><Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgdW5pcXVlX2lkPSI3MDA2Mzg0MDUiIHNyYz0iQ049d3NhYWhvbW8sIE89QUZJUCwgQz1BUiwgU0VSSUFMTlVNQkVSPUNVSVQgMzM2OTM0NTAyMzkiIGdlbl90aW1lPSIxNDM0NjU1MDg3IiBleHBfdGltZT0iMTQzNDY5ODM0NyIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiLz4KICAgIDxvcGVyYXRpb24gdmFsdWU9ImdyYW50ZWQiIHR5cGU9ImxvZ2luIj4KICAgICAgICA8bG9naW4gdWlkPSJDPWFyLCBPPXZpY3RvciBoIHRvbG9zYSwgU0VSSUFMTlVNQkVSPUNVSVQgMjAwNDc0Mjg5NzIsIENOPXNpc3RlbWEgdG9sb3NhIiBzZXJ2aWNlPSJ3c2ZlIiByZWdtZXRob2Q9IjIyIiBlbnRpdHk9IjMzNjkzNDUwMjM5IiBhdXRobWV0aG9kPSJjbXMiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIHJlbHR5cGU9IjQiIGtleT0iMjAwNDc0Mjg5NzIiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4KCg==</Token><Sign>OQxVH4E1sDVHpgHN4Y3CNbi3V4xhEQJyUNqYeyoFJOxOV0uqYySXHndP4WferqPT/fuCv13fVnM9FMx7rE55YDoPpsh8+kfYOcpHK28/z87Oju624dxRJ+LBkdeiE6NZVzzztlZEgirufd6nVV0NzXjx5EOeCXkBJTKRVIeUG/c=</Sign><Cuit>20047428972</Cuit></Auth><FeCAEReq><FeCabReq><CantReg>1</CantReg><PtoVta>1</PtoVta><CbteTipo>1</CbteTipo></FeCabReq><FeDetReq><FECAEDetRequest><Concepto>1</Concepto><DocTipo>80</DocTipo><DocNro>30662071680</DocNro><CbteDesde>3</CbteDesde><CbteHasta>3</CbteHasta><CbteFch>20150618</CbteFch><ImpTotal>179.25</ImpTotal><ImpTotConc>2.00</ImpTotConc><ImpNeto>150.00</ImpNeto><ImpOpEx>0.00</ImpOpEx><ImpTrib>1.00</ImpTrib><ImpIVA>26.25</ImpIVA><FchVtoPago></FchVtoPago><MonId>PES</MonId><MonCotiz>1.000</MonCotiz><Tributos><Tributo><Id>99</Id><Desc>Impuesto Municipal Matanza'</Desc><BaseImp>100.00</BaseImp><Alic>0.10</Alic><Importe>0.10</Importe></Tributo><Tributo><Id>4</Id><Desc>Impuestos internos</Desc><BaseImp>100.00</BaseImp><Alic>0.40</Alic><Importe>0.40</Importe></Tributo><Tributo><Id>1</Id><Desc>Impuesto nacional</Desc><BaseImp>50.00</BaseImp><Alic>1.00</Alic><Importe>0.50</Importe></Tributo></Tributos><Iva><AlicIva><Id>5</Id><BaseImp>100.00</BaseImp><Importe>21.00</Importe></AlicIva><AlicIva><Id>4</Id><BaseImp>50.00</BaseImp><Importe>5.25</Importe></AlicIva></Iva><Opcionales><Opcional><Id>5</Id><Valor>02</Valor></Opcional><Opcional><Id>61</Id><Valor>80</Valor></Opcional><Opcional><Id>62</Id><Valor>20267565393</Valor></Opcional><Opcional><Id>7</Id><Valor>01</Valor></Opcional></Opcionales></FECAEDetRequest></FeDetReq></FeCAEReq></FECAESolicitar>
</soap:Body>
</soap:Envelope>